In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('Customer')

+-------------+---------+------------+--------+
| customer_id |   name  | visited_on | amount |
+-------------+---------+------------+--------+
|      1      |   Jhon  | 2019-01-01 |  100   |
|      2      |  Daniel | 2019-01-02 |  110   |
|      3      |   Jade  | 2019-01-03 |  120   |
|      4      |  Khaled | 2019-01-04 |  130   |
|      5      | Winston | 2019-01-05 |  110   |
|      6      |  Elvis  | 2019-01-06 |  140   |
|      7      |   Anna  | 2019-01-07 |  150   |
|      8      |  Maria  | 2019-01-08 |   80   |
|      9      |   Jaze  | 2019-01-09 |  110   |
|      1      |   Jhon  | 2019-01-10 |  130   |
|      3      |   Jade  | 2019-01-10 |  150   |
+-------------+---------+------------+--------+

#### *You are the restaurant owner and you want to analyze a possible expansion (there will be at least one customer every day).*

### Write an SQL query to compute the moving average of how much the customer paid in a seven days window (i.e., current day + 6 days before). average_amount should be rounded to two decimal places.

#### *Return result table ordered by visited_on in ascending order.*

```
+--------------+--------------+----------------+
| visited_on   | amount       | average_amount |
+--------------+--------------+----------------+
| 2019-01-07   | 860          | 122.86         |
| 2019-01-08   | 840          | 120            |
| 2019-01-09   | 840          | 120            |
| 2019-01-10   | 1000         | 142.86         |
+--------------+--------------+----------------+
Explanation: 
1st moving average from 2019-01-01 to 2019-01-07 has an average_amount of (100 + 110 + 120 + 130 + 110 + 140 + 150)/7 = 122.86
2nd moving average from 2019-01-02 to 2019-01-08 has an average_amount of (110 + 120 + 130 + 110 + 140 + 150 + 80)/7 = 120
3rd moving average from 2019-01-03 to 2019-01-09 has an average_amount of (120 + 130 + 110 + 140 + 150 + 80 + 110)/7 = 120
4th moving average from 2019-01-04 to 2019-01-10 has an average_amount of (130 + 110 + 140 + 150 + 80 + 110 + 130 + 150)/7 = 142.86
```

In [3]:
%%sql 

SELECT 
    visited_on,
    amount,
    AVG(amount) OVER(ORDER BY visited_on
    ROWS BETWEEN 7 PRECEDING AND CURRENT ROW)
    AS average_amount
FROM Customer

[(datetime.date(2019, 1, 1), 100, Decimal('100.0000')),
 (datetime.date(2019, 1, 2), 110, Decimal('105.0000')),
 (datetime.date(2019, 1, 3), 120, Decimal('110.0000')),
 (datetime.date(2019, 1, 4), 130, Decimal('115.0000')),
 (datetime.date(2019, 1, 5), 110, Decimal('114.0000')),
 (datetime.date(2019, 1, 6), 140, Decimal('118.3333')),
 (datetime.date(2019, 1, 7), 150, Decimal('122.8571')),
 (datetime.date(2019, 1, 8), 80, Decimal('117.5000')),
 (datetime.date(2019, 1, 9), 110, Decimal('118.7500')),
 (datetime.date(2019, 1, 10), 130, Decimal('121.2500')),
 (datetime.date(2019, 1, 10), 150, Decimal('125.0000'))]

In [4]:
%%sql 

SELECT 
    visited_on,
    ROUND(SUM(amount) OVER(ORDER BY visited_on
    ROWS BETWEEN 7 PRECEDING AND CURRENT ROW), 2) 
    AS amount,
    ROUND(AVG(amount) OVER(ORDER BY visited_on
    ROWS BETWEEN 7 PRECEDING AND CURRENT ROW), 2)
    AS average_amount
FROM Customer

[(datetime.date(2019, 1, 1), Decimal('100'), Decimal('100.00')),
 (datetime.date(2019, 1, 2), Decimal('210'), Decimal('105.00')),
 (datetime.date(2019, 1, 3), Decimal('330'), Decimal('110.00')),
 (datetime.date(2019, 1, 4), Decimal('460'), Decimal('115.00')),
 (datetime.date(2019, 1, 5), Decimal('570'), Decimal('114.00')),
 (datetime.date(2019, 1, 6), Decimal('710'), Decimal('118.33')),
 (datetime.date(2019, 1, 7), Decimal('860'), Decimal('122.86')),
 (datetime.date(2019, 1, 8), Decimal('940'), Decimal('117.50')),
 (datetime.date(2019, 1, 9), Decimal('950'), Decimal('118.75')),
 (datetime.date(2019, 1, 10), Decimal('970'), Decimal('121.25')),
 (datetime.date(2019, 1, 10), Decimal('1000'), Decimal('125.00'))]

### Solution using subquery

In [5]:
%%sql 
-- in case there are days with multiple sales
SELECT 
    visited_on,
    SUM(amount) AS daily_total
FROM Customer
GROUP BY visited_on

[(datetime.date(2019, 1, 1), Decimal('100')),
 (datetime.date(2019, 1, 2), Decimal('110')),
 (datetime.date(2019, 1, 3), Decimal('120')),
 (datetime.date(2019, 1, 4), Decimal('130')),
 (datetime.date(2019, 1, 5), Decimal('110')),
 (datetime.date(2019, 1, 6), Decimal('140')),
 (datetime.date(2019, 1, 7), Decimal('150')),
 (datetime.date(2019, 1, 8), Decimal('80')),
 (datetime.date(2019, 1, 9), Decimal('110')),
 (datetime.date(2019, 1, 10), Decimal('280'))]

In [6]:
%%sql 

SELECT 
    visited_on,
    SUM(amount) AS daily_total
FROM Customer
GROUP BY visited_on

[(datetime.date(2019, 1, 1), Decimal('100')),
 (datetime.date(2019, 1, 2), Decimal('110')),
 (datetime.date(2019, 1, 3), Decimal('120')),
 (datetime.date(2019, 1, 4), Decimal('130')),
 (datetime.date(2019, 1, 5), Decimal('110')),
 (datetime.date(2019, 1, 6), Decimal('140')),
 (datetime.date(2019, 1, 7), Decimal('150')),
 (datetime.date(2019, 1, 8), Decimal('80')),
 (datetime.date(2019, 1, 9), Decimal('110')),
 (datetime.date(2019, 1, 10), Decimal('280'))]

In [7]:
%%sql 

WITH daily_total_cte AS (
    SELECT 
        visited_on,
        SUM(amount) AS daily_total 
    FROM Customer
    GROUP BY visited_on
),
daily_average_cte AS (
    SELECT 
        visited_on,
        SUM(amount) AS daily_total 
    FROM Customer
    GROUP BY visited_on
)
SELECT 
    a.visited_on AS visited_on,
    SUM(b.daily_total) AS amount,
    AVG(b.daily_total) AS average_amount
FROM daily_total_cte a
JOIN daily_average_cte b
GROUP BY visited_on

[(datetime.date(2019, 1, 10), Decimal('1330'), Decimal('133.0000')),
 (datetime.date(2019, 1, 9), Decimal('1330'), Decimal('133.0000')),
 (datetime.date(2019, 1, 8), Decimal('1330'), Decimal('133.0000')),
 (datetime.date(2019, 1, 7), Decimal('1330'), Decimal('133.0000')),
 (datetime.date(2019, 1, 6), Decimal('1330'), Decimal('133.0000')),
 (datetime.date(2019, 1, 5), Decimal('1330'), Decimal('133.0000')),
 (datetime.date(2019, 1, 4), Decimal('1330'), Decimal('133.0000')),
 (datetime.date(2019, 1, 3), Decimal('1330'), Decimal('133.0000')),
 (datetime.date(2019, 1, 2), Decimal('1330'), Decimal('133.0000')),
 (datetime.date(2019, 1, 1), Decimal('1330'), Decimal('133.0000'))]

In [8]:
%%sql 

WITH daily_total_cte AS (
    SELECT 
        visited_on,
        SUM(amount) AS daily_total 
    FROM Customer
    GROUP BY visited_on
),
daily_average_cte AS (
    SELECT 
        visited_on,
        SUM(amount) AS daily_total 
    FROM Customer
    GROUP BY visited_on
)
SELECT 
    a.visited_on AS visited_on,
    SUM(b.daily_total) AS amount,
    ROUND(AVG(b.daily_total),2) AS average_amount
FROM daily_total_cte a
JOIN daily_average_cte b
WHERE DATEDIFF(a.visited_on, b.visited_on) BETWEEN 0 AND 6
GROUP BY a.visited_on

[(datetime.date(2019, 1, 7), Decimal('860'), Decimal('122.86')),
 (datetime.date(2019, 1, 6), Decimal('710'), Decimal('118.33')),
 (datetime.date(2019, 1, 5), Decimal('570'), Decimal('114.00')),
 (datetime.date(2019, 1, 4), Decimal('460'), Decimal('115.00')),
 (datetime.date(2019, 1, 3), Decimal('330'), Decimal('110.00')),
 (datetime.date(2019, 1, 2), Decimal('210'), Decimal('105.00')),
 (datetime.date(2019, 1, 1), Decimal('100'), Decimal('100.00')),
 (datetime.date(2019, 1, 8), Decimal('840'), Decimal('120.00')),
 (datetime.date(2019, 1, 9), Decimal('840'), Decimal('120.00')),
 (datetime.date(2019, 1, 10), Decimal('1000'), Decimal('142.86'))]

In [9]:
%%sql 

WITH daily_total_cte AS (
    SELECT 
        visited_on,
        SUM(amount) AS daily_total 
    FROM Customer
    GROUP BY visited_on
),
daily_average_cte AS (
    SELECT 
        visited_on,
        SUM(amount) AS daily_total 
    FROM Customer
    GROUP BY visited_on
)
SELECT 
    a.visited_on AS visited_on,
    SUM(b.daily_total) AS amount,
    ROUND(AVG(b.daily_total), 2) AS average_amount
FROM daily_total_cte a
JOIN daily_average_cte b 
WHERE DATEDIFF(a.visited_on, b.visited_on) BETWEEN 0 AND 6
GROUP BY a.visited_on
HAVING COUNT(b.visited_on) = 7

[(datetime.date(2019, 1, 7), Decimal('860'), Decimal('122.86')),
 (datetime.date(2019, 1, 8), Decimal('840'), Decimal('120.00')),
 (datetime.date(2019, 1, 9), Decimal('840'), Decimal('120.00')),
 (datetime.date(2019, 1, 10), Decimal('1000'), Decimal('142.86'))]

# Using Pandas

In [10]:
import pandas as pd 
import numpy as np

In [11]:
customer_query = %sql SELECT * FROM Customer # type: ignore
customer_df = customer_query.DataFrame()

display(customer_df)

    customer_id     name  visited_on  amount
0             1     Jhon  2019-01-01     100
1             2   Daniel  2019-01-02     110
2             3     Jade  2019-01-03     120
3             4   Khaled  2019-01-04     130
4             5  Winston  2019-01-05     110
5             6    Elvis  2019-01-06     140
6             7     Anna  2019-01-07     150
7             8    Maria  2019-01-08      80
8             9     Jaze  2019-01-09     110
9             1     Jhon  2019-01-10     130
10            3     Jade  2019-01-10     150

In [12]:
customer_df.set_index('visited_on', inplace=True)
customer_df

            customer_id     name  amount
visited_on
2019-01-01            1     Jhon     100
2019-01-02            2   Daniel     110
2019-01-03            3     Jade     120
2019-01-04            4   Khaled     130
2019-01-05            5  Winston     110
2019-01-06            6    Elvis     140
2019-01-07            7     Anna     150
2019-01-08            8    Maria      80
2019-01-09            9     Jaze     110
2019-01-10            1     Jhon     130
2019-01-10            3     Jade     150

In [13]:
customer_df.groupby('visited_on').agg({'amount': 'sum'})

            amount
visited_on
2019-01-01     100
2019-01-02     110
2019-01-03     120
2019-01-04     130
2019-01-05     110
2019-01-06     140
2019-01-07     150
2019-01-08      80
2019-01-09     110
2019-01-10     280

In [14]:
grouped_df = customer_df.groupby('visited_on').agg({'amount': 'sum'}).reset_index()
grouped_df

   visited_on  amount
0  2019-01-01     100
1  2019-01-02     110
2  2019-01-03     120
3  2019-01-04     130
4  2019-01-05     110
5  2019-01-06     140
6  2019-01-07     150
7  2019-01-08      80
8  2019-01-09     110
9  2019-01-10     280

In [15]:
avg_df = grouped_df['amount'].rolling(window=7).mean()
avg_df.dropna()

6    122.857143
7    120.000000
8    120.000000
9    142.857143
Name: amount, dtype: float64

In [16]:
avg_df.dropna(inplace=True)

In [17]:
sum_df = grouped_df['amount'].rolling(window=7).sum()
sum_df

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
5       NaN
6     860.0
7     840.0
8     840.0
9    1000.0
Name: amount, dtype: float64

In [18]:
sum_df.dropna(inplace=True)

In [19]:
merged_df = pd.merge(avg_df, sum_df, right_index=True, left_index=True)
merged_df

     amount_x  amount_y
6  122.857143     860.0
7  120.000000     840.0
8  120.000000     840.0
9  142.857143    1000.0